package org.dao;

import org.model.Trainee;

public interface TraineeDao {
	//-----------------------------------增---------------------------------------
	public long addTrainee(Trainee o);
	//-----------------------------------删---------------------------------------
	//-----------------------------------改---------------------------------------
	//-----------------------------------查---------------------------------------	
	/**
	 * 4.1查询该学员是否有关联过订单
	 * @param trainee_id
	 * @return
	 */
	public boolean getOrderTrainee(Long trainee_id);
}
