package org.dao;

import org.model.UserLink;

public interface UserLinkDao {
	//-----------------------------------增---------------------------------------
	public long addUserLink(UserLink ul);
	//-----------------------------------删---------------------------------------
	//-----------------------------------改---------------------------------------
	//-----------------------------------查---------------------------------------
	/**
	 * 4.1通过id查询父级节点
	 * @param child
	 * @return
	 */
	public long getParentByChild(Long child);
}
